; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob85) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate2)
	(at pallet1 distributor0)
	(clear crate6)
	(at pallet2 distributor1)
	(clear crate4)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 349)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 272)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 95)
	(at crate1 distributor0)
	(on crate1 crate0)
	(= (weight crate1) 75)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 77)
	(at crate3 distributor1)
	(on crate3 pallet2)
	(= (weight crate3) 27)
	(at crate4 distributor1)
	(on crate4 crate3)
	(= (weight crate4) 66)
	(at crate5 distributor0)
	(on crate5 crate1)
	(= (weight crate5) 40)
	(at crate6 distributor0)
	(on crate6 crate5)
	(= (weight crate6) 72)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet0)
		(on crate3 crate6)
		(on crate4 crate5)
		(on crate5 pallet1)
		(on crate6 crate0)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist1 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 5
2. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 5
3. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 72
   goals met: 0 of 5
4. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 11 to 21
   goals met: 0 of 5
5. (lift hoist2 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist2) (on crate4 crate3)
   added: (lifting hoist2 crate4) (clear crate3)
   changed: (fuel-cost) from 21 to 22
   goals met: 0 of 5
6. (load hoist2 crate4 truck0 distributor1)
   deleted: (lifting hoist2 crate4)
   added: (in crate4 truck0) (available hoist2)
   changed: (current_load truck0) from 72 to 138
   goals met: 0 of 5
7. (lift hoist2 crate3 pallet2 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 pallet2)
   added: (lifting hoist2 crate3) (clear pallet2)
   changed: (fuel-cost) from 22 to 23
   goals met: 0 of 5
8. (load hoist2 crate3 truck0 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck0) (available hoist2)
   changed: (current_load truck0) from 138 to 165
   goals met: 0 of 5
9. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 23 to 33
   goals met: 0 of 5
10. (unload hoist1 crate6 truck0 distributor0)
   deleted: (in crate6 truck0) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck0) from 165 to 93
   goals met: 0 of 5
11. (drop hoist1 crate6 crate5 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate5)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate5)
   goals met: 0 of 5
12. (unload hoist1 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck0) from 93 to 66
   goals met: 0 of 5
13. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 33 to 43
   goals met: 0 of 5
14. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   changed: (fuel-cost) from 43 to 44
   goals met: 0 of 5
15. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 66 to 143
   goals met: 0 of 5
16. (load hoist1 crate3 truck1 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 27
   goals met: 0 of 5
17. (lift hoist1 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   changed: (fuel-cost) from 44 to 45
   goals met: 0 of 5
18. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 27 to 99
   goals met: 0 of 5
19. (lift hoist1 crate5 crate1 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate1)
   added: (lifting hoist1 crate5) (clear crate1)
   changed: (fuel-cost) from 45 to 46
   goals met: 0 of 5
20. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 99 to 139
   goals met: 0 of 5
21. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate0)
   added: (lifting hoist1 crate1) (clear crate0)
   changed: (fuel-cost) from 46 to 47
   goals met: 0 of 5
22. (load hoist1 crate1 truck1 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck1) (available hoist1)
   changed: (current_load truck1) from 139 to 214
   goals met: 0 of 5
23. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 214 to 142
   goals met: 0 of 5
24. (drop hoist1 crate6 crate0 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate0)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 crate0)
   goals met: 1 of 5
25. (unload hoist1 crate3 truck1 distributor0)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck1) from 142 to 115
   goals met: 1 of 5
26. (drop hoist1 crate3 crate6 distributor0)
   deleted: (lifting hoist1 crate3) (clear crate6)
   added: (available hoist1) (at crate3 distributor0) (clear crate3) (on crate3 crate6)
   goals met: 2 of 5
27. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 115 to 75
   goals met: 2 of 5
28. (drop hoist1 crate5 crate3 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate3)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 crate3)
   goals met: 2 of 5
29. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 47 to 57
   goals met: 2 of 5
30. (unload hoist1 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck0) from 143 to 77
   goals met: 2 of 5
31. (load hoist1 crate4 truck1 distributor0)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   changed: (current_load truck1) from 75 to 141
   goals met: 2 of 5
32. (lift hoist1 crate5 crate3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate3)
   added: (lifting hoist1 crate5) (clear crate3)
   changed: (fuel-cost) from 57 to 58
   goals met: 2 of 5
33. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 141 to 181
   goals met: 2 of 5
34. (lift hoist1 crate3 crate6 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist1) (on crate3 crate6)
   added: (lifting hoist1 crate3) (clear crate6)
   changed: (fuel-cost) from 58 to 59
   goals met: 1 of 5
35. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   changed: (current_load truck0) from 77 to 104
   goals met: 1 of 5
36. (lift hoist1 crate6 crate0 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate0)
   added: (lifting hoist1 crate6) (clear crate0)
   changed: (fuel-cost) from 59 to 60
   goals met: 0 of 5
37. (load hoist1 crate6 truck0 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   changed: (current_load truck0) from 104 to 176
   goals met: 0 of 5
38. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 60 to 61
   goals met: 0 of 5
39. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 176 to 271
   goals met: 0 of 5
40. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 61 to 71
   goals met: 0 of 5
41. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 271 to 176
   goals met: 0 of 5
42. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet0)
   goals met: 1 of 5
43. (unload hoist1 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   changed: (current_load truck1) from 181 to 141
   goals met: 1 of 5
44. (drop hoist1 crate5 pallet1 distributor0)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (available hoist1) (at crate5 distributor0) (clear crate5) (on crate5 pallet1)
   goals met: 2 of 5
45. (unload hoist1 crate4 truck1 distributor0)
   deleted: (in crate4 truck1) (available hoist1)
   added: (lifting hoist1 crate4)
   changed: (current_load truck1) from 141 to 75
   goals met: 2 of 5
46. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 176 to 104
   goals met: 2 of 5
47. (drop hoist0 crate6 crate0 depot0)
   deleted: (lifting hoist0 crate6) (clear crate0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate0)
   goals met: 3 of 5
48. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck0) from 104 to 77
   goals met: 3 of 5
49. (drop hoist0 crate3 crate6 depot0)
   deleted: (lifting hoist0 crate3) (clear crate6)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 crate6)
   goals met: 4 of 5
50. (drop hoist1 crate4 crate5 distributor0)
   deleted: (lifting hoist1 crate4) (clear crate5)
   added: (available hoist1) (at crate4 distributor0) (clear crate4) (on crate4 crate5)
   goals met: 5 of 5
